from math import *
from re import L # імпортуємо всі функції з модуля math

# Зайві коментарі видаліть перед захистом проекту!!!!!

# Отримуємо а, b, h від користувача
a = float(input("Введите а: ")) 
b = float(input("Введите b: ")) 
h = float(input("Введите h: "))

x = a # Присвоюємо х значення нижньої границі нашого діапазону
list_of_values = [] # Створюємо список в який будемо складувати значення х та у
max_values = [0, -10000]  # Створюємо список для збереження максимального значення х та y беремо -10000 щоб будь яке значення у було більшим за наше

# Создаємо цикл з лічильником
while x <= b:

    # Визначаємо у для значення х та округлюємо одразу до 4 знаків після коми
    y = round((1 / (x * x + 1)) + x * x, 4) # x*x те саме, що й х в другій степені 
    x = round(x, 4) # округлюємо х, щоб мати більш гарний вигляд

    list_of_values.append([x, y]) # Записуємо в список list_of_values список, що має всередині значення x та y
    
    # Створюємо умову коли значення у більше за наше збережене тоді змінюємо значення максимального х та у в змінній
    if y > max_values[1]:
        max_values[1] = y
        max_values[0] = x

    # додаємо до поточного значення х шаг h
    x = x + h # можна написати x += h

print(list_of_values) # Виводимо список значень
print("Найбільше значення у - " + str(max_values)) # Виводимо найбільше значення у