# Перед захистом роботи видалити зайві коментарі !!!!!!!

# Беремо рядок від користувача замінюємо пробіли, крапки та коми на спеціальний символ і розбиваємо строку по цьому символу
# Приклад строки для вводу - театр,. кіно., мармелад попкорн

s = input("Введіть строку: ").replace(" ", "&").replace(".", "&").replace(",", "&").split("&")

# Створюємо змінні для збереження максимального та мінімального за довжиною слова призначаемо перше слово списку для обох
max_length_word = s[0]
min_length_word = s[0]

# Проходимось по списку слів і якщо ми натикаємось на слово, а не на пусту строку то робимо перевірки
for i in s:
    if i != "":
        
        # Якщо слово більше за довжиною ніж в нашій змінній то міняємо значення змінної і навпаки для мінімального
        if len(i) < len(min_length_word):
            min_length_word = i
        elif len(i) > len(max_length_word):
            max_length_word = i


print(min_length_word, max_length_word)

